[{"content":"Typically the convenience of a CSS framework like Bulma comes at the cost of sending loads of unused css to the browser increasing load times and hindering user experience. So just don't use Bulma (or Bootstrap, Tailwind, or otherwise) right? No, that can't be the answer. These frameworks add to the designer's experience and ability to quickly turn around a finished design. \n\nEnter [Purge CSS](https://www.purgecss.com/). Purge CSS crawls through your html and css comparing them and removing any unused selectors from your stylesheets at build time so that they can be as slim as possible. So all those useful classes that Bulma has but you just aren't using right now won't slow down your site. And then maybe you decide to use one of them in the future. BOOM, it's there next time you compile with no thought on your part. \n\nSince Awake is built on the JAM Stack, it can easily take advantage of this technology and so Purge CSS is baked right in. It's that simple. Use Bulma to your hearts content without the bloat.\n\n\n\n# Caveats\n\nThere are some caveats to Purge CSS especially around dynamically created classes. Since these classes aren't fully fleshed out in the .vue files, Purge CSS doesn't know they exist and therefore will strip out their  corresponding css. The fix is pretty simple though, Purge CSS allows us to whitelist classes that should never be purged whether they are found in the html or not. The whitelisting process is described in full in the [Purge CSS docs](https://www.purgecss.com/whitelisting). You can set the `whitelist` option as well as any other purge css option in `config/build.js`.\n","isEmpty":false,"excerpt":"","title":"Light CSS Footprint","subtitle":"Purge CSS Bundles Only the Required CSS","category":["category-1","category-3"],"author":"Daniel Kelly","date":"2019-07-29T17:30:16.858Z","featureImage":"/uploads/purge-css-hero.jpg","slug":"light-css-footprint"},{"content":"Disqus brings the power of commenting to the Awake template. It provides features like moderation, reactions, filtering, and social sharing out of the box. Best of all, it's free and super easy to setup!\n\n## Step 1\n\nGo to disqus.com and click on \"Get Started\"\n\n![Screenshot of Disqus homepage](/uploads/disqus-get-started.jpg)\n\n## Step 2\n\nChoose \"I want to install Disqus on my site\"\n\n![Disqus button \"I want to install Disqus on my site\"](/uploads/disqus-add-to-website.jpg)\n\n## Step 3\n\nSign-up or sign in\n\n## Step 4\n\nEnter site name, Disqus URL and select a category. The Disqus URL name is your site’s name in your account where you can access all the required settings.\n\n## Step 5\n\nSelect a plan. There are several premium versions available, but don't worry the free one works just great too!\n\n## Step 6\n\nDisqus supports a number of different platforms but also works great in static sites like Awake. Scroll to the very bottom of the list and choose: \"I don't see my platform listed, install manually with\"\n\n![Disqus button \"I don't see my platform listed, install manually with\"](/uploads/disqus-platform-button.jpg)\n\n## Step 7\n\nYou can ignore everything on this page, as the Awake template has already configured it for you. All you have to do is find your \"Site Short Name\" (it's the first part of the url) and add it to `config/_siteConfig.js`.\n\nTake it from here:\n\n![Site Short Name in url](/uploads/disqus-site-short-name.jpg)\n\nand put it here:\n\n```\n// config/_siteConfig.js\nexport default {\n...\n// Disqus\n  disqus: {\n    on: false,\n    loadingStrategy: 'button', // Options: onload, lazy, button\n    siteShortName: 'testing-bjsj2bjl0i'\n  },\n}\n```\n\n## Step 8\n\nThat's it! You've got comments up and running on your site. Go checkout a post and see your new fancy comments section.\n","isEmpty":false,"excerpt":"","title":"Comments Support","subtitle":"Add Comments to Posts With Disqus","category":["category-1","category-3"],"author":"Daniel Kelly","date":"2019-07-24T19:59:59.000Z","featureImage":"/uploads/disqus-hero.jpg","slug":"comments-support"},{"content":"Awake is a Nuxt.js template for generating a beautifully robust static site with blog in as few steps as possible. \n\n# Features\n\n* Simple modern design based on the Bulma css framework (with unused css purged via [purgecss](https://www.purgecss.com/))\n* Site search\n* Statically generated API for posts and categories\n* Disqus powered comments\n* Mailchimp powered newsletter\n* Highly customizable with out of the box configurations\n* Built with performance in mind\n* Isolated Netlify CMS driver (with more CMS drivers planned for future) for easily migrating between various headless cms'\n* Feature images automatically given srcsets and resized\n\nDeploy to Netlify Button Here\n\n# Configuration\n\nSite configuration is found in `/config/_siteConfig.js`. Here you can customize site settings such as the site name, layout, disqus and mailchimp setup, image sizes and more. \n\n# Editing Content\n\nPosts and categories can be edited in Netlify CMS at \\[your-site-url]/admin. At this time any new pages must be created in the code itself and committed to the repo\n\n# Local Development\n\nSince all content is store in the git repo with Netlify CMS, local development is a breeze. Simply install node, pull down the repo, and run `npm run dev`.\n","isEmpty":false,"excerpt":"","title":"Getting Started","subtitle":"Get Up and Running with Awake","category":["category-1","category-3"],"author":"Daniel Kelly","date":"2019-07-23T19:59:59.000Z","featureImage":"/uploads/getting-started-hero.jpg","slug":"getting-started-with-awake"},{"content":"This is the post body, where I write about our last chance to party before the Y2K bug destroys us all.\n","isEmpty":false,"excerpt":"","layout":"blog","title":"Seventh Post","subtitle":"Hardy","date":"2019-07-07 11:59:59 -0800","featureImage":"https://picsum.photos/1800/907","category":["category-2"],"slug":"seventh-post"},{"content":"This is the post body, where I write about our last chance to party before the Y2K bug destroys us all.\n","isEmpty":false,"excerpt":"","layout":"blog","title":"Sixth Post","subtitle":"Hardy","date":"2019-07-06 11:59:59 -0800","featureImage":"https://picsum.photos/1800/906","category":["category-2"],"slug":"sixth-post"},{"content":"This is the post body, where I write about our last chance to party before the Y2K bug destroys us all.\n","isEmpty":false,"excerpt":"","layout":"blog","title":"Fifth Post","subtitle":"Hardy","date":"2019-07-05 11:59:59 -0800","featureImage":"https://picsum.photos/1800/905","category":["category-1","category-3"],"slug":"fifth-post"}]