[{"content":"Awake is a Nuxt.js template for generating a beautifully robust static site with blog in as few steps as possible. \n\n# Features\n\n* Simple modern design based on the Bulma css framework (with unused css purged via [purgecss](https://www.purgecss.com/))\n* Site search\n* Statically generated API for posts and categories\n* Disqus powered comments\n* Mailchimp powered newsletter\n* Highly customizable with out of the box configurations\n* Built with performance in mind\n* Isolated Netlify CMS driver (with more CMS drivers planned for future) for easily migrating between various headless cms'\n* Images automatically resized for various screens and given srcsets\n\nDeploy to Netlify Button Here\n\n# Configuration\n\nSite configuration is found in `/config/_siteConfig.js`. Here you can customize site settings such as the site name, layout, disqus and mailchimp setup, image sizes and more. Any of these can be setup to use environment variables if you so desire, in order to be able to configure them directly from the Netlify interface. See the setup for google analytics which already uses an environment variable as an example of this.\n\n```\ngoogleAnalytics: {\n    on: true,\n    id: process.env.GOOGLE_ANALYTICS_ID\n},\n```\n\n# Editing Content\n\nPosts and categories can be edited in Netlify CMS at \\[your-site-url]/admin. At this time any new pages must be created in the code itself and committed to the repo\n\n# Local Development\n\nSince all content is store in the git repo with Netlify CMS, local development is a breeze. Simply install node, pull down the repo, install the dependencies with `npm install`, and run `npm run dev`.\n","isEmpty":false,"excerpt":"","title":"Getting Started","subtitle":"Get Up and Running with Awake","category":["About Awake"],"author":"Daniel Kelly","date":"2019-08-03T19:59:59.000Z","featureImage":"/uploads/getting-started-hero.jpg","slug":"getting-started-with-awake"},{"content":"The `ResourceGrid` powers the grid display of both posts and categories in the Awake template. It's a powerful, fast, and flexible component to grab a grid of any size or content when you need it.\n\n| Prop     | Description                                          | Type   | Default           |\n| -------- | ---------------------------------------------------- | ------ | ----------------- |\n| perRow   | how many resources to displayed per row              | Number | 3                 |\n| number   | total number of resources to display                 | Number | all (lazy loaded) |\n| category | for posts filters posts only in supplied category(s) | Array  | \\[]               |\n| resource | the resource to be retrieved and displayed           | String | Required          |\n\nThere are 2 simple wrappers built around the `ResourceGrid` for easily displaying a categories grid or a posts grid, easily enough they are `CategoriesGrid` and `PostsGrid`.\n\n## Examples\n```\n<--! All posts in grid with 3 per row lazy loaded until no more-->\n<posts-grid />\n\n<--! 3 posts in grid in single row -->\n<posts-grid :number=\"3\" />\n\n<--! 3 posts in grid in single row in category-1 (exactly how related posts at end of single post is accomplished) -->\n<posts-grid :number=\"3\" :category=\"['category-1']\" />\n\n<--! All categories in grid with 3 per row lazy loaded until no more-->\n<categories-grid />\n\n<--! etc -->\n```\n(Note grids must be imported into page/component to use)\n","isEmpty":false,"excerpt":"","title":"ResourceGrid.vue","subtitle":"Easily Display Grid of Posts/Categories Throughout the Site","category":["About Awake"],"author":"Daniel Kelly","date":"2019-08-02T04:27:56.800Z","featureImage":"/uploads/resource-grid-hero.jpg","slug":"resourcegrid-vue"},{"content":"Awake is fast for a couple different reasons. It both capitalizes on the platform it's built for (JAM Stack) and the framework it's built on (Nuxt.js) as well as includes some intentional optimizations to improve the end user experience when it comes to speed. \n\n## The JAM Stack\n\nThe JAM stack is a way of building websites that compile down basically to html, css, and javascript and then is served over a CDN. API's are then sprinkled in to add more advanced functionality where needed. Because there is no server, no computations to run, initial response time is like lightening. \n\n## Nuxt.js\n\n[Nuxt.js](https://www.nuxtjs.org) has the ability to generate static sites that are served on the JAM Stack, building plain old html files... but those html files are super-powered with Vue.js. What this means, is that pages have content \"hard coded\" into the html files for top-rate SEO scores but after initial page load behave as a traditional SPA with smooth page transitions, minimal data served between requests, etc. This means Awake is fast both on both the first page visitors hit and even faster on subsequent pages.\n\n## Purge CSS\n\nAwake uses the [Bulma](https://bulma.io/) framework for a starting place for styles but certainly doesn't use every style the Bulma framework provides. [Purge CSS](https://www.purgecss.com/) minimizes the css sent to the browser by removing any unused styles at compile time. You can read more about how Awake uses Purge CSS in this [post](/light-css-footprint).\n\n## Opti-Image + Responsive Loader\n\n[Opti-Image](https://www.npmjs.com/package/opti-image) is a little vue component I wrote to be able to serve images in the most performant way possible. It supports webp's for browser's that support it (though not using the webp functionality for Awake, yet...), lazy loading out of the box, and easy srcset management. [Responsive Loader (the Nuxt Flavor)](https://www.npmjs.com/package/nuxt-responsive-loader) auto optimizes image quality for best performance in the browser and creates multiple sizes for different devices. Combine these 2 together and all image on Awake are basically guaranteed to fly. \n\n## Font Awesome 5\n\nAwake comes with Font Awesome 5 support out of the box, so you have a wealth of free quality icons at your finger tips. However, if you're used to using Font Awesome in the more traditional manner without a build step you may be thinking: \"What about all those icons I don't actually use? Aren't they just bloat?\" Not so with Awake, with webpack we can bundle only the icons we're using. This does mean an extra step of registering a new icon when you want to use it, but that's as easy as adding it to an array in `config/modules.js` like so: \n\n```\n icons: ['faTimes', 'faSearch', 'faEnvelope', 'faUser', 'faBriefcase']\n```\n\n## Lazy Loading Like Crazy\n\nIn order to speed up both compile time and page load time, basically everything but the header, footer, hero, and main content of the posts are lazy loaded. All grids are lazy loaded with infinite scroll and all images (feature images and those in posts) are also lazy loaded. Comments can be lazy loaded or loaded on click of \"Show Comments\" button.\n\n## Pretty Stinkin' Fast, I'd Say\n\nI've taken a number of steps to try and make Awake as fast and snappy as possible for the end user and I think you'll find it's been handled fairly well. Last I ran one of the posts through Page Speed Insights I got a 99 score for desktop and 89 for mobile. [Give it a try for yourself!](https://developers.google.com/speed/pagespeed/insights/?url=https%3A%2F%2Fawake-template.netlify.com%2Fpost-markup-and-formatting%2F&tab=desktop)\n\n![Page speed insights score 99!!](/uploads/page-speed-insights.jpg)\n","isEmpty":false,"excerpt":"","title":"Built For Speed","subtitle":"Awake is Built to Be Blazing Fast","category":["About Awake"],"author":"Daniel Kelly","date":"2019-08-02T04:27:56.800Z","featureImage":"/uploads/marc-olivier-jodoin-nqoinj-ttqm-unsplash.jpg","slug":"built-for-speed"},{"content":"You're publishing great content! Make sure people can get it easily right in their inbox with Awake's ready to go Mailchimp integration. Follow these instructions to get your newsletter up and running\n\n## 1. Signup with Mailchimp\n\nIf you don't already have a mailchimp account, head on over to [mailchimp.com](https://mailchimp.com) and sign up (don't worry they have free tiers that will give you all you probably need).\n\n## 2. Create a New Campaign\n\nGo to \"Campaigns\" in the main navigation of the Mailchimp dashboard and then click the \"Create Campaign\" button on the top right.\n\n## 3. Start Signup Form\n\nFrom the modal overlay that appears choose \"Signup Form\", then click \"Begin\" under \"Embedded Form\"\n\n![Mailchimp create signup form](/uploads/screen-shot-2019-08-01-at-1.03.08-pm.png)\n\n## 4. Get Form Action\n\nUnder \"Copy/paste onto your site\" you'll see the markup  for the newsletter form. Just copy the form action value from the form\n\n![copy form action from mailchimp](/uploads/screen-shot-2019-08-01-at-1.05.09-pm.png)\n\n## 5. Add the Action to the Awake Site Configuration\n\n```\n// Can be the form action on a mail chimp form, a hubspot form,\n// or any other url you want to post the form data tomailchimp: {\n    on: true,\n    formAction:'enter url here'\n}\n```\n","isEmpty":false,"excerpt":"","title":"Newsletter Signup","subtitle":"Awake Integrates with Mailchimp for Easy Newsletter Management","category":["Third Party Integrations"],"author":"Daniel Kelly","date":"2019-08-01T03:49:49.295Z","featureImage":"/uploads/mailchimp.jpg","slug":"newsletter-signup"},{"content":"Typically the convenience of a CSS framework like Bulma comes at the cost of sending loads of unused css to the browser increasing load times and hindering user experience. So just don't use Bulma (or Bootstrap, Tailwind, or otherwise) right? No, that can't be the answer. These frameworks add to the designer's experience and ability to quickly turn around a finished design. \n\nEnter [Purge CSS](https://www.purgecss.com/). Purge CSS crawls through your html and css comparing them and removing any unused selectors from your stylesheets at build time so that they can be as slim as possible. So all those useful classes that Bulma has but you just aren't using right now won't slow down your site. And then maybe you decide to use one of them in the future. BOOM, it's there next time you compile with no thought on your part. \n\nSince Awake is built on the JAM Stack, it can easily take advantage of this technology and so Purge CSS is baked right in. It's that simple. Use Bulma to your hearts content without the bloat.\n\n\n\n# Caveats\n\nThere are some caveats to Purge CSS especially around dynamically created classes. Since these classes aren't fully fleshed out in the .vue files, Purge CSS doesn't know they exist and therefore will strip out their  corresponding css. The fix is pretty simple though, Purge CSS allows us to whitelist classes that should never be purged whether they are found in the html or not. The whitelisting process is described in full in the [Purge CSS docs](https://www.purgecss.com/whitelisting). You can set the `whitelist` option as well as any other purge css option in `config/build.js`.\nSometimes when dev mode and adding markup that uses classes that have not previously been in use, you must restart dev mode for Purge CSS to pick up on the change. \n","isEmpty":false,"excerpt":"","title":"Light CSS Footprint","subtitle":"Purge CSS Bundles Only the Required CSS","category":["About Awake"],"author":"Daniel Kelly","date":"2019-07-29T17:30:16.858Z","featureImage":"/uploads/purge-css-hero.jpg","slug":"light-css-footprint"},{"content":"Disqus brings the power of commenting to the Awake template. It provides features like moderation, reactions, filtering, and social sharing out of the box. Best of all, it's free and super easy to setup!\n\n## Step 1\n\nGo to disqus.com and click on \"Get Started\"\n\n![Screenshot of Disqus homepage](/uploads/disqus-get-started.jpg)\n\n## Step 2\n\nChoose \"I want to install Disqus on my site\"\n\n![Disqus button \"I want to install Disqus on my site\"](/uploads/disqus-add-to-website.jpg)\n\n## Step 3\n\nSign-up or sign in\n\n## Step 4\n\nEnter site name, Disqus URL and select a category. The Disqus URL name is your site’s name in your account where you can access all the required settings.\n\n## Step 5\n\nSelect a plan. There are several premium versions available, but don't worry the free one works just great too!\n\n## Step 6\n\nDisqus supports a number of different platforms but also works great in static sites like Awake. Scroll to the very bottom of the list and choose: \"I don't see my platform listed, install manually with\"\n\n![Disqus button \"I don't see my platform listed, install manually with\"](/uploads/disqus-platform-button.jpg)\n\n## Step 7\n\nYou can ignore everything on this page, as the Awake template has already configured it for you. All you have to do is find your \"Site Short Name\" (it's the first part of the url) and add it to `config/_siteConfig.js`.\n\nTake it from here:\n\n![Site Short Name in url](/uploads/disqus-site-short-name.jpg)\n\nand put it here:\n\n```\n// config/_siteConfig.js\nexport default {\n...\n// Disqus\n  disqus: {\n    on: false,\n    loadingStrategy: 'button', // Options: onload, lazy, button\n    siteShortName: 'testing-bjsj2bjl0i'\n  },\n}\n```\n\n## Step 8\n\nThat's it! You've got comments up and running on your site. Go checkout a post and see your new fancy comments section.\n","isEmpty":false,"excerpt":"","title":"Comments Support","subtitle":"Add Comments to Posts With Disqus","category":["Third Party Integrations"],"author":"Daniel Kelly","date":"2019-07-24T19:59:59.000Z","featureImage":"/uploads/disqus-hero.jpg","slug":"comments-support"}]